app/controllers/main_controller.rb

  def index
    @developers = Developer.limit(3)
    @hits = Product.all.limit(8)
---
SELECT "developers".* FROM "developers" LIMIT $1  [["LIMIT", 3]]
SELECT "products".* FROM "products" WHERE "products"."hit" = $1 LIMIT $2  [["hit", 1], ["LIMIT", 8]]